Tekla Open API Reference for Tekla Structures 2025
Text.TextAttributes.ArrowHead Property
 The arrowhead of the leader line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrowheadAttributes ArrowHead { get; set; }
Public Property ArrowHead As ArrowheadAttributes
	Get
	Set
Property Value
Type: ArrowheadAttributes
See Also
Reference
Text.TextAttributes Class
Tekla.Structures.Drawing Namespace